import math
a = float(input('Введите значение для а: '))
b = float(input('Введите значение для b: '))
c = float(input('Введите значение для c: '))
x1 = (-b+(b**2-4*a*c)**0.5)/2
x2 = (-b-(b**2-4*a*c)**0.5)/2
print(f"Первый вариант решения:\r\n(-b+(b**2-4*a*c)**0.5)/2:\r\n(-{b}+({b}**2-4*{a}*{c})**0.5)/2:\r\n(-{b}+({b**2}-{4*a*c})**0.5)/2:\r\n({-b+(b**2-4*a*c)**0.5})/2:\r\n(-{b}+({b**2-4*a*c})**0.5)/2\r\n{x1}\r\n")
print(f"Второй вариант решения:\r\n(-b-(b**2-4*a*c)**0.5)/2:\r\n(-{b}-({b}**2-4*{a}*{c})**0.5)/2:\r\n(-{b}-({b**2}-{4*a*c})**0.5)/2:\r\n({-b-(b**2-4*a*c)**0.5})/2:\r\n(-{b}-({b**2-4*a*c})**0.5)/2\r\n{x2}")
